src/cfe/КСП/DataProcessors/КСП_АРМЗагрузчикЗаказовКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>КСП_АРМЗагрузчикЗаказовКлиента</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_СведенияОФайлахЗагрузкиЗаказовКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_СведенияОФайлахЗагрузкиЗаказовКлиента</Name>
			<Comment>Хранение сведений об обработанных файлах загрузчика заказов клиента</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_СтатусыЗагрузкиФайловЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_РежимыЗагрузкиФайловЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Журнал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_РежимыЗагрузкиФайловЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_РежимыЗагрузкиФайловЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/DataProcessors/КСП_АРМЗагрузчикЗаказовКлиента/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьСодержаниеЯчейки(пТабличныйДокумент, Строка, Колонка) Экспорт	
	Если Колонка = 0 Тогда
		Возврат "";
	КонецЕсли;	
	мСодержание = пТабличныйДокумент.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;	
	Возврат СокрЛП(мСодержание);
КонецФункции

&НаСервере
Процедура ЗагрузкаЗаказа(ДвоичДанные, Расширение, ПолноеИмя) Экспорт

	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичДанные.Записать(ИмяФайла);
	
	Заказ = Документы.ЗаказКлиента.СоздатьДокумент();
	Заказ.Дата = ТекущаяДата();
	Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	Заказ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
    ТабличныйДокумент.Прочитать(ИмяФайла);
	
	КоличествоСтраниц = 1;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		КоличествоСтрок = ТабличныйДокумент.Области.Найти("Итоговый_лист").Низ;
		Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 6, 7)) Тогда
			Заказ.КСП_Коллекция = Справочники.КоллекцииНоменклатуры.НайтиПоНаименованию(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 6, 7));
		КонецЕсли;
		Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 4, 7)) Тогда
			Заказ.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 4, 7));
		КонецЕсли;

        МассивРазмеров = Новый Массив;
		Для НомерКолонки = 11 По 19 Цикл
			МассивРазмеров.Добавить(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 10, НомерКолонки));
		КонецЦикла;
		Для НомерСтроки = 13 По КоличествоСтрок Цикл
			Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 4)) Тогда
				Для НомерКолонки = 11 По 19 Цикл
					Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, НомерКолонки)) Тогда 
						Нстр = Заказ.Товары.Добавить();
						НаименованиеТовара = ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 4);
						Модель = ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 5);
						Цвет = ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 7);
		
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	Номенклатура.Ссылка КАК Ссылка,
							|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка1,
							|	Номенклатура.Наименование КАК Наименование
							|ИЗ
							|	Справочник.Номенклатура КАК Номенклатура
							|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
							|		ПО Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
							|ГДЕ
							|	Номенклатура.Наименование ПОДОБНО ""%"" + &Модель + ""%""";
						Запрос.УстановитьПараметр("Модель", Модель);
						Запрос.УстановитьПараметр("Размер", МассивРазмеров[НомерКолонки - 11]);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Если СтрНайти(ВыборкаДетальныеЗаписи.Наименование, Цвет) Тогда
								Нстр.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
								поискХарактеристики = "-" + СокрЛП(МассивРазмеров[НомерКолонки - 11] + "-");
								Если СтрНайти(ВыборкаДетальныеЗаписи.Ссылка1, поискХарактеристики) > 0 Тогда
									Нстр.Характеристика = ВыборкаДетальныеЗаписи.Ссылка1;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;

	//					Если ЗначениеЗаполнено(ТекТовар) Тогда
	//						Нстр.Номенклатура	= ТекТовар;
	//						Нстр.Характеристика = текХарактеристика;
	//
	//						Запрос = Новый Запрос;
	//						Запрос.Текст = 
	//							"ВЫБРАТЬ
	//							|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	//							|ИЗ
	//							|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	//							|ГДЕ
	//							|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
	//						
	//						Запрос.УстановитьПараметр("Номенклатура", ТекТовар);
	//						
	//						РезультатЗапроса = Запрос.Выполнить();
	//						
	//						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//						
	//						Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//							Нстр.КСП_БазоваяЦена = ВыборкаДетальныеЗаписи.Цена;
	//						КонецЕсли;
	//
	//					КонецЕсли;
						Нстр.КоличествоУпаковок	= Число(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, НомерКолонки));
						Нстр.Цена = ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 21);
						Нстр.Сумма = Нстр.КоличествоУпаковок * Нстр.Цена;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	 
	
	Попытка
		Заказ.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		НоваяЗапись = РегистрыСведений.КСП_СведенияОФайлахЗагрузкиЗаказовКлиента.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Файл = ПолноеИмя;
		НоваяЗапись.Заказ = Заказ.Ссылка;
		НоваяЗапись.Режим = Перечисления.КСП_РежимыЗагрузкиФайловЗаказа.Вручную;
		НоваяЗапись.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.КаталогЗагрузки = Константы.КСП_КаталогЗагрузкиЗаказовКлиента.Получить();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНаСервере(ДвоичДанные, Расширение, ИмяФайла)
	ЗагрузкаЗаказа(ДвоичДанные,Расширение, ИмяФайла);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр = "Книга Excel(*.xls; *.xlsx)|*.xls; *.xlsx";
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	ДиалогФыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогФыбораФайла.ИндексФильтра = 0;
	Если ДиалогФыбораФайла.Выбрать() Тогда		
        ИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;	
	
	нФайл = Новый Файл(ИмяФайла);
	
	//Если НЕ нФайл.Существует() Тогда
	//	Возврат;
	//КонецЕсли;
	
	ДвоичДанные = Новый ДвоичныеДанные(ИмяФайла);
	ЗагрузитьФайлНаСервере(ДвоичДанные, нФайл.Расширение, ИмяФайла);

	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентноеЗадание(Команда)
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьБланкЗаказаНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Обработки.КСП_АРМЗагрузчикЗаказовКлиента.ПолучитьМакет("КСП_БланкЗаказа");
	Область = Макет.ПолучитьОбласть("Бланк");
	ТабДок.Вывести(Область);
	
	возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьБланкЗаказа(Команда)

	табПечати = ВыгрузитьБланкЗаказаНаСервере();
	табПечати.Показать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьИзКаталогаНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзКаталога(Команда)
	НайденныеФайлы = НайтиФайлы(ЭтаФорма.КаталогЗагрузки, "*.xls");
	Для каждого текФайл Из НайденныеФайлы Цикл
		ДвоичДанные = Новый ДвоичныеДанные(текФайл.ПолноеИмя);
		ЗагрузитьФайлНаСервере(ДвоичДанные, текФайл.Расширение, текФайл.ПолноеИмя);
	КонецЦикла;
    ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КаталогЗагрузкиПриИзмененииНаСервере(КаталогЗагрузки)
	Константы.КСП_КаталогЗагрузкиЗаказовКлиента.Установить(КаталогЗагрузки);
КонецПроцедуры

&НаКлиенте
Процедура КаталогЗагрузкиПриИзменении(Элемент)
	КаталогЗагрузкиПриИзмененииНаСервере(ЭтаФорма.КаталогЗагрузки);
КонецПроцедуры

&НаКлиенте
Процедура КаталогЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогФыбораФайла.Заголовок = "Выберите каталог";
	ДиалогФыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогФыбораФайла.ИндексФильтра = 0;
	Если ДиалогФыбораФайла.Выбрать() Тогда		
        ЭтаФорма.КаталогЗагрузки = ДиалогФыбораФайла.Каталог;
	КонецЕсли;	
    КаталогЗагрузкиПриИзмененииНаСервере(ДиалогФыбораФайла.Каталог);
КонецПроцедуры

&НаКлиенте
Процедура ЗагруженныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Если Поле.Имя = "ЗагруженныеФайлыЗаказ" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Заказ);
	//КонецЕсли;
КонецПроцедуры
